{"keras_version": "2.1.2", "backend": "tensorflow", "class_name": "Sequential", "config": [{"class_name": "Conv2D", "config": {"kernel_regularizer": null, "kernel_constraint": null, "padding": "valid", "bias_constraint": null, "batch_input_shape": [null, 28, 28, 1], "activation": "relu", "name": "conv2d_1", "data_format": "channels_last", "bias_regularizer": null, "use_bias": true, "strides": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 32, "trainable": true, "dtype": "float32", "dilation_rate": [1, 1], "kernel_size": [5, 5], "kernel_initializer": {"class_name": "RandomUniform", "config": {"maxval": 0.05, "minval": -0.05, "seed": null}}, "activity_regularizer": null}}, {"class_name": "MaxPooling2D", "config": {"pool_size": [2, 2], "strides": [2, 2], "trainable": true, "data_format": "channels_last", "name": "max_pooling2d_1", "padding": "valid"}}, {"class_name": "Conv2D", "config": {"kernel_regularizer": null, "kernel_constraint": null, "padding": "valid", "bias_constraint": null, "activation": "relu", "name": "conv2d_2", "kernel_size": [3, 3], "bias_regularizer": null, "use_bias": true, "strides": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 32, "trainable": true, "dilation_rate": [1, 1], "data_format": "channels_last", "kernel_initializer": {"class_name": "RandomUniform", "config": {"maxval": 0.05, "minval": -0.05, "seed": null}}, "activity_regularizer": null}}, {"class_name": "MaxPooling2D", "config": {"pool_size": [2, 2], "strides": [2, 2], "trainable": true, "data_format": "channels_last", "name": "max_pooling2d_2", "padding": "valid"}}, {"class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true}}, {"class_name": "Dense", "config": {"kernel_regularizer": null, "bias_constraint": null, "activity_regularizer": null, "name": "dense_1", "activation": "relu", "bias_regularizer": null, "use_bias": true, "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 128, "trainable": true, "kernel_initializer": {"class_name": "RandomUniform", "config": {"maxval": 0.05, "minval": -0.05, "seed": null}}}}, {"class_name": "Dropout", "config": {"name": "dropout_1", "noise_shape": null, "trainable": true, "seed": null, "rate": 0.5}}, {"class_name": "Dense", "config": {"kernel_regularizer": null, "bias_constraint": null, "activity_regularizer": null, "name": "dense_2", "activation": "softmax", "bias_regularizer": null, "use_bias": true, "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 25, "trainable": true, "kernel_initializer": {"class_name": "RandomUniform", "config": {"maxval": 0.05, "minval": -0.05, "seed": null}}}}]}