{"keras_version": "2.1.2", "backend": "tensorflow", "class_name": "Sequential", "config": [{"class_name": "Conv2D", "config": {"kernel_regularizer": null, "kernel_constraint": null, "padding": "valid", "bias_constraint": null, "batch_input_shape": [null, 28, 28, 1], "activation": "relu", "name": "conv2d_6", "data_format": "channels_last", "bias_regularizer": null, "use_bias": true, "strides": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 32, "trainable": true, "dtype": "float32", "dilation_rate": [1, 1], "kernel_size": [5, 5], "kernel_initializer": {"class_name": "RandomUniform", "config": {"maxval": 0.05, "minval": -0.05, "seed": null}}, "activity_regularizer": null}}, {"class_name": "Dense", "config": {"kernel_regularizer": null, "bias_constraint": null, "batch_input_shape": [null, 28, 28, 1], "activation": "relu", "name": "dense_8", "activity_regularizer": null, "bias_regularizer": null, "use_bias": true, "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 30, "trainable": true, "dtype": "float32", "kernel_initializer": {"class_name": "RandomUniform", "config": {"maxval": 0.05, "minval": -0.05, "seed": null}}}}, {"class_name": "MaxPooling2D", "config": {"pool_size": [2, 2], "strides": [2, 2], "trainable": true, "data_format": "channels_last", "name": "max_pooling2d_7", "padding": "valid"}}, {"class_name": "Dense", "config": {"kernel_regularizer": null, "bias_constraint": null, "activity_regularizer": null, "name": "dense_9", "activation": "relu", "bias_regularizer": null, "use_bias": true, "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 30, "trainable": true, "kernel_initializer": {"class_name": "RandomUniform", "config": {"maxval": 0.05, "minval": -0.05, "seed": null}}}}, {"class_name": "MaxPooling2D", "config": {"pool_size": [2, 2], "strides": [2, 2], "trainable": true, "data_format": "channels_last", "name": "max_pooling2d_8", "padding": "valid"}}, {"class_name": "Flatten", "config": {"name": "flatten_4", "trainable": true}}, {"class_name": "Dense", "config": {"kernel_regularizer": null, "bias_constraint": null, "activity_regularizer": null, "name": "dense_10", "activation": "softmax", "bias_regularizer": null, "use_bias": true, "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 25, "trainable": true, "kernel_initializer": {"class_name": "RandomUniform", "config": {"maxval": 0.05, "minval": -0.05, "seed": null}}}}]}