{"config": [{"config": {"strides": [1, 1], "kernel_size": [5, 5], "kernel_constraint": null, "padding": "valid", "kernel_regularizer": null, "filters": 32, "activity_regularizer": null, "trainable": true, "bias_regularizer": null, "data_format": "channels_last", "bias_constraint": null, "use_bias": true, "dtype": "float32", "activation": "relu", "kernel_initializer": {"config": {"minval": -0.05, "seed": null, "maxval": 0.05}, "class_name": "RandomUniform"}, "name": "conv2d_5", "batch_input_shape": [null, 28, 28, 1], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "dilation_rate": [1, 1]}, "class_name": "Conv2D"}, {"config": {"data_format": "channels_last", "name": "max_pooling2d_5", "padding": "valid", "pool_size": [2, 2], "strides": [2, 2], "trainable": true}, "class_name": "MaxPooling2D"}, {"config": {"strides": [1, 1], "kernel_size": [3, 3], "padding": "valid", "kernel_constraint": null, "kernel_regularizer": null, "filters": 32, "use_bias": true, "bias_regularizer": null, "trainable": true, "data_format": "channels_last", "bias_constraint": null, "name": "conv2d_6", "activation": "relu", "activity_regularizer": null, "kernel_initializer": {"config": {"minval": -0.05, "seed": null, "maxval": 0.05}, "class_name": "RandomUniform"}, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "dilation_rate": [1, 1]}, "class_name": "Conv2D"}, {"config": {"data_format": "channels_last", "name": "max_pooling2d_6", "padding": "valid", "pool_size": [2, 2], "strides": [2, 2], "trainable": true}, "class_name": "MaxPooling2D"}, {"config": {"name": "flatten_3", "trainable": true}, "class_name": "Flatten"}, {"config": {"kernel_constraint": null, "kernel_regularizer": null, "name": "dense_5", "use_bias": true, "trainable": true, "bias_constraint": null, "activation": "relu", "bias_regularizer": null, "activity_regularizer": null, "kernel_initializer": {"config": {"minval": -0.05, "seed": null, "maxval": 0.05}, "class_name": "RandomUniform"}, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "units": 128}, "class_name": "Dense"}, {"config": {"rate": 0.5, "name": "dropout_3", "noise_shape": null, "trainable": true, "seed": null}, "class_name": "Dropout"}, {"config": {"kernel_constraint": null, "kernel_regularizer": null, "name": "dense_6", "use_bias": true, "trainable": true, "bias_constraint": null, "activation": "softmax", "bias_regularizer": null, "activity_regularizer": null, "kernel_initializer": {"config": {"minval": -0.05, "seed": null, "maxval": 0.05}, "class_name": "RandomUniform"}, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "units": 25}, "class_name": "Dense"}], "backend": "tensorflow", "keras_version": "2.1.2", "class_name": "Sequential"}